Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/prime_bootloader/firmware/src/packs/PIC32CX2051MTG128_DFP/component/matrix.h
#define MATRIX_PPSELR_USERP_Pos               _UINT32_(0)                                          /* (MATRIX_PPSELR Position) User PSELy Peripheral */
#define MATRIX_PPSELR_USERP_Msk               (_UINT32_(0xFFFFFFFF) << MATRIX_PPSELR_USERP_Pos)    /* (MATRIX_PPSELR Mask) USERP */
#define MATRIX_PPSELR_USERP(value)            (MATRIX_PPSELR_USERP_Msk & (_UINT32_(value) << MATRIX_PPSELR_USERP_Pos)) 

/** \brief MATRIX register offsets definitions */
#define MATRIX_PRAS_REG_OFST           _UINT32_(0x00)      /* (MATRIX_PRAS) Priority Register A for Slave 0 Offset */
#define MATRIX_PRBS_REG_OFST           _UINT32_(0x04)      /* (MATRIX_PRBS) Priority Register B for Slave 0 Offset */
#define MATRIX_MCFG_REG_OFST           _UINT32_(0x00)      /* (MATRIX_MCFG) Master Configuration Register Offset */
#define MATRIX_MCFG0_REG_OFST          _UINT32_(0x00)      /* (MATRIX_MCFG0) Master Configuration Register Offset */
#define MATRIX_MCFG1_REG_OFST          _UINT32_(0x04)      /* (MATRIX_MCFG1) Master Configuration Register Offset */
#define MATRIX_MCFG2_REG_OFST          _UINT32_(0x08)      /* (MATRIX_MCFG2) Master Configuration Register Offset */
#define MATRIX_MCFG3_REG_OFST          _UINT32_(0x0C)      /* (MATRIX_MCFG3) Master Configuration Register Offset */
#define MATRIX_MCFG4_REG_OFST          _UINT32_(0x10)      /* (MATRIX_MCFG4) Master Configuration Register Offset */
#define MATRIX_MCFG5_REG_OFST          _UINT32_(0x14)      /* (MATRIX_MCFG5) Master Configuration Register Offset */
#define MATRIX_MCFG6_REG_OFST          _UINT32_(0x18)      /* (MATRIX_MCFG6) Master Configuration Register Offset */
#define MATRIX_MCFG7_REG_OFST          _UINT32_(0x1C)      /* (MATRIX_MCFG7) Master Configuration Register Offset */
#define MATRIX_MCFG8_REG_OFST          _UINT32_(0x20)      /* (MATRIX_MCFG8) Master Configuration Register Offset */
#define MATRIX_MCFG9_REG_OFST          _UINT32_(0x24)      /* (MATRIX_MCFG9) Master Configuration Register Offset */
#define MATRIX_MCFG10_REG_OFST         _UINT32_(0x28)      /* (MATRIX_MCFG10) Master Configuration Register Offset */
#define MATRIX_MCFG11_REG_OFST         _UINT32_(0x2C)      /* (MATRIX_MCFG11) Master Configuration Register Offset */
#define MATRIX_MCFG12_REG_OFST         _UINT32_(0x30)      /* (MATRIX_MCFG12) Master Configuration Register Offset */
#define MATRIX_MCFG13_REG_OFST         _UINT32_(0x34)      /* (MATRIX_MCFG13) Master Configuration Register Offset */
#define MATRIX_MCFG14_REG_OFST         _UINT32_(0x38)      /* (MATRIX_MCFG14) Master Configuration Register Offset */
#define MATRIX_MCFG15_REG_OFST         _UINT32_(0x3C)      /* (MATRIX_MCFG15) Master Configuration Register Offset */
#define MATRIX_SCFG_REG_OFST           _UINT32_(0x40)      /* (MATRIX_SCFG) Slave Configuration Register Offset */
#define MATRIX_SCFG0_REG_OFST          _UINT32_(0x40)      /* (MATRIX_SCFG0) Slave Configuration Register Offset */
#define MATRIX_SCFG1_REG_OFST          _UINT32_(0x44)      /* (MATRIX_SCFG1) Slave Configuration Register Offset */
#define MATRIX_SCFG2_REG_OFST          _UINT32_(0x48)      /* (MATRIX_SCFG2) Slave Configuration Register Offset */
#define MATRIX_SCFG3_REG_OFST          _UINT32_(0x4C)      /* (MATRIX_SCFG3) Slave Configuration Register Offset */
#define MATRIX_SCFG4_REG_OFST          _UINT32_(0x50)      /* (MATRIX_SCFG4) Slave Configuration Register Offset */
#define MATRIX_SCFG5_REG_OFST          _UINT32_(0x54)      /* (MATRIX_SCFG5) Slave Configuration Register Offset */
#define MATRIX_SCFG6_REG_OFST          _UINT32_(0x58)      /* (MATRIX_SCFG6) Slave Configuration Register Offset */
#define MATRIX_SCFG7_REG_OFST          _UINT32_(0x5C)      /* (MATRIX_SCFG7) Slave Configuration Register Offset */
#define MATRIX_SCFG8_REG_OFST          _UINT32_(0x60)      /* (MATRIX_SCFG8) Slave Configuration Register Offset */
#define MATRIX_SCFG9_REG_OFST          _UINT32_(0x64)      /* (MATRIX_SCFG9) Slave Configuration Register Offset */
#define MATRIX_SCFG10_REG_OFST         _UINT32_(0x68)      /* (MATRIX_SCFG10) Slave Configuration Register Offset */
#define MATRIX_SCFG11_REG_OFST         _UINT32_(0x6C)      /* (MATRIX_SCFG11) Slave Configuration Register Offset */
#define MATRIX_SCFG12_REG_OFST         _UINT32_(0x70)      /* (MATRIX_SCFG12) Slave Configuration Register Offset */
#define MATRIX_SCFG13_REG_OFST         _UINT32_(0x74)      /* (MATRIX_SCFG13) Slave Configuration Register Offset */
#define MATRIX_SCFG14_REG_OFST         _UINT32_(0x78)      /* (MATRIX_SCFG14) Slave Configuration Register Offset */
#define MATRIX_SCFG15_REG_OFST         _UINT32_(0x7C)      /* (MATRIX_SCFG15) Slave Configuration Register Offset */
#define MATRIX_MRCR_REG_OFST           _UINT32_(0x100)     /* (MATRIX_MRCR) Master Remap Control Register Offset */
#define MATRIX_SFR_REG_OFST            _UINT32_(0x110)     /* (MATRIX_SFR) Special Function Register Offset */
#define MATRIX_SFR0_REG_OFST           _UINT32_(0x110)     /* (MATRIX_SFR0) Special Function Register Offset */
#define MATRIX_SFR1_REG_OFST           _UINT32_(0x114)     /* (MATRIX_SFR1) Special Function Register Offset */
#define MATRIX_SFR2_REG_OFST           _UINT32_(0x118)     /* (MATRIX_SFR2) Special Function Register Offset */
#define MATRIX_SFR3_REG_OFST           _UINT32_(0x11C)     /* (MATRIX_SFR3) Special Function Register Offset */
#define MATRIX_SFR4_REG_OFST           _UINT32_(0x120)     /* (MATRIX_SFR4) Special Function Register Offset */
#define MATRIX_SFR5_REG_OFST           _UINT32_(0x124)     /* (MATRIX_SFR5) Special Function Register Offset */
#define MATRIX_SFR6_REG_OFST           _UINT32_(0x128)     /* (MATRIX_SFR6) Special Function Register Offset */
#define MATRIX_SFR7_REG_OFST           _UINT32_(0x12C)     /* (MATRIX_SFR7) Special Function Register Offset */
#define MATRIX_SFR8_REG_OFST           _UINT32_(0x130)     /* (MATRIX_SFR8) Special Function Register Offset */
#define MATRIX_SFR9_REG_OFST           _UINT32_(0x134)     /* (MATRIX_SFR9) Special Function Register Offset */
#define MATRIX_SFR10_REG_OFST          _UINT32_(0x138)     /* (MATRIX_SFR10) Special Function Register Offset */
#define MATRIX_SFR11_REG_OFST          _UINT32_(0x13C)     /* (MATRIX_SFR11) Special Function Register Offset */
#define MATRIX_SFR12_REG_OFST          _UINT32_(0x140)     /* (MATRIX_SFR12) Special Function Register Offset */
#define MATRIX_SFR13_REG_OFST          _UINT32_(0x144)     /* (MATRIX_SFR13) Special Function Register Offset */
#define MATRIX_SFR14_REG_OFST          _UINT32_(0x148)     /* (MATRIX_SFR14) Special Function Register Offset */
#define MATRIX_SFR15_REG_OFST          _UINT32_(0x14C)     /* (MATRIX_SFR15) Special Function Register Offset */
#define MATRIX_MEIER_REG_OFST          _UINT32_(0x150)     /* (MATRIX_MEIER) Master Error Interrupt Enable Register Offset */
#define MATRIX_MEIDR_REG_OFST          _UINT32_(0x154)     /* (MATRIX_MEIDR) Master Error Interrupt Disable Register Offset */
#define MATRIX_MEIMR_REG_OFST          _UINT32_(0x158)     /* (MATRIX_MEIMR) Master Error Interrupt Mask Register Offset */
#define MATRIX_MESR_REG_OFST           _UINT32_(0x15C)     /* (MATRIX_MESR) Master Error Status Register Offset */
#define MATRIX_MEAR_REG_OFST           _UINT32_(0x160)     /* (MATRIX_MEAR) Master 0 Error Address Register Offset */
#define MATRIX_MEAR0_REG_OFST          _UINT32_(0x160)     /* (MATRIX_MEAR0) Master 0 Error Address Register Offset */
#define MATRIX_MEAR1_REG_OFST          _UINT32_(0x164)     /* (MATRIX_MEAR1) Master 0 Error Address Register Offset */
#define MATRIX_MEAR2_REG_OFST          _UINT32_(0x168)     /* (MATRIX_MEAR2) Master 0 Error Address Register Offset */
#define MATRIX_MEAR3_REG_OFST          _UINT32_(0x16C)     /* (MATRIX_MEAR3) Master 0 Error Address Register Offset */
#define MATRIX_MEAR4_REG_OFST          _UINT32_(0x170)     /* (MATRIX_MEAR4) Master 0 Error Address Register Offset */
#define MATRIX_MEAR5_REG_OFST          _UINT32_(0x174)     /* (MATRIX_MEAR5) Master 0 Error Address Register Offset */
#define MATRIX_MEAR6_REG_OFST          _UINT32_(0x178)     /* (MATRIX_MEAR6) Master 0 Error Address Register Offset */
#define MATRIX_MEAR7_REG_OFST          _UINT32_(0x17C)     /* (MATRIX_MEAR7) Master 0 Error Address Register Offset */
#define MATRIX_MEAR8_REG_OFST          _UINT32_(0x180)     /* (MATRIX_MEAR8) Master 0 Error Address Register Offset */
#define MATRIX_MEAR9_REG_OFST          _UINT32_(0x184)     /* (MATRIX_MEAR9) Master 0 Error Address Register Offset */
#define MATRIX_MEAR10_REG_OFST         _UINT32_(0x188)     /* (MATRIX_MEAR10) Master 0 Error Address Register Offset */
#define MATRIX_MEAR11_REG_OFST         _UINT32_(0x18C)     /* (MATRIX_MEAR11) Master 0 Error Address Register Offset */
#define MATRIX_MEAR12_REG_OFST         _UINT32_(0x190)     /* (MATRIX_MEAR12) Master 0 Error Address Register Offset */
#define MATRIX_MEAR13_REG_OFST         _UINT32_(0x194)     /* (MATRIX_MEAR13) Master 0 Error Address Register Offset */
#define MATRIX_MEAR14_REG_OFST         _UINT32_(0x198)     /* (MATRIX_MEAR14) Master 0 Error Address Register Offset */
#define MATRIX_MEAR15_REG_OFST         _UINT32_(0x19C)     /* (MATRIX_MEAR15) Master 0 Error Address Register Offset */
#define MATRIX_WPMR_REG_OFST           _UINT32_(0x1E4)     /* (MATRIX_WPMR) Write Protect Mode Register Offset */
#define MATRIX_WPSR_REG_OFST           _UINT32_(0x1E8)     /* (MATRIX_WPSR) Write Protect Status Register Offset */
#define MATRIX_VERSION_REG_OFST        _UINT32_(0x1FC)     /* (MATRIX_VERSION) Version Register Offset */
#define MATRIX_PSR_REG_OFST            _UINT32_(0x200)     /* (MATRIX_PSR) Protection Slave 0 Register Offset */
#define MATRIX_PSR0_REG_OFST           _UINT32_(0x200)     /* (MATRIX_PSR0) Protection Slave 0 Register Offset */
#define MATRIX_PSR1_REG_OFST           _UINT32_(0x204)     /* (MATRIX_PSR1) Protection Slave 0 Register Offset */
#define MATRIX_PSR2_REG_OFST           _UINT32_(0x208)     /* (MATRIX_PSR2) Protection Slave 0 Register Offset */
#define MATRIX_PSR3_REG_OFST           _UINT32_(0x20C)     /* (MATRIX_PSR3) Protection Slave 0 Register Offset */
#define MATRIX_PSR4_REG_OFST           _UINT32_(0x210)     /* (MATRIX_PSR4) Protection Slave 0 Register Offset */
#define MATRIX_PSR5_REG_OFST           _UINT32_(0x214)     /* (MATRIX_PSR5) Protection Slave 0 Register Offset */
#define MATRIX_PSR6_REG_OFST           _UINT32_(0x218)     /* (MATRIX_PSR6) Protection Slave 0 Register Offset */
#define MATRIX_PSR7_REG_OFST           _UINT32_(0x21C)     /* (MATRIX_PSR7) Protection Slave 0 Register Offset */
#define MATRIX_PSR8_REG_OFST           _UINT32_(0x220)     /* (MATRIX_PSR8) Protection Slave 0 Register Offset */
#define MATRIX_PSR9_REG_OFST           _UINT32_(0x224)     /* (MATRIX_PSR9) Protection Slave 0 Register Offset */
#define MATRIX_PSR10_REG_OFST          _UINT32_(0x228)     /* (MATRIX_PSR10) Protection Slave 0 Register Offset */
#define MATRIX_PSR11_REG_OFST          _UINT32_(0x22C)     /* (MATRIX_PSR11) Protection Slave 0 Register Offset */
#define MATRIX_PSR12_REG_OFST          _UINT32_(0x230)     /* (MATRIX_PSR12) Protection Slave 0 Register Offset */
#define MATRIX_PSR13_REG_OFST          _UINT32_(0x234)     /* (MATRIX_PSR13) Protection Slave 0 Register Offset */
#define MATRIX_PSR14_REG_OFST          _UINT32_(0x238)     /* (MATRIX_PSR14) Protection Slave 0 Register Offset */
#define MATRIX_PSR15_REG_OFST          _UINT32_(0x23C)     /* (MATRIX_PSR15) Protection Slave 0 Register Offset */
#define MATRIX_PASSR_REG_OFST          _UINT32_(0x240)     /* (MATRIX_PASSR) Protected Areas Split Slave 0 Register Offset */
#define MATRIX_PASSR0_REG_OFST         _UINT32_(0x240)     /* (MATRIX_PASSR0) Protected Areas Split Slave 0 Register Offset */
#define MATRIX_PASSR1_REG_OFST         _UINT32_(0x244)     /* (MATRIX_PASSR1) Protected Areas Split Slave 0 Register Offset */
#define MATRIX_PASSR2_REG_OFST         _UINT32_(0x248)     /* (MATRIX_PASSR2) Protected Areas Split Slave 0 Register Offset */
#define MATRIX_PASSR3_REG_OFST         _UINT32_(0x24C)     /* (MATRIX_PASSR3) Protected Areas Split Slave 0 Register Offset */
#define MATRIX_PASSR4_REG_OFST         _UINT32_(0x250)     /* (MATRIX_PASSR4) Protected Areas Split Slave 0 Register Offset */
#define MATRIX_PASSR5_REG_OFST         _UINT32_(0x254)     /* (MATRIX_PASSR5) Protected Areas Split Slave 0 Register Offset */
#define MATRIX_PASSR6_REG_OFST         _UINT32_(0x258)     /* (MATRIX_PASSR6) Protected Areas Split Slave 0 Register Offset */
#define MATRIX_PASSR7_REG_OFST         _UINT32_(0x25C)     /* (MATRIX_PASSR7) Protected Areas Split Slave 0 Register Offset */
#define MATRIX_PASSR8_REG_OFST         _UINT32_(0x260)     /* (MATRIX_PASSR8) Protected Areas Split Slave 0 Register Offset */
#define MATRIX_PASSR9_REG_OFST         _UINT32_(0x264)     /* (MATRIX_PASSR9) Protected Areas Split Slave 0 Register Offset */
#define MATRIX_PASSR10_REG_OFST        _UINT32_(0x268)     /* (MATRIX_PASSR10) Protected Areas Split Slave 0 Register Offset */
#define MATRIX_PASSR11_REG_OFST        _UINT32_(0x26C)     /* (MATRIX_PASSR11) Protected Areas Split Slave 0 Register Offset */
#define MATRIX_PASSR12_REG_OFST        _UINT32_(0x270)     /* (MATRIX_PASSR12) Protected Areas Split Slave 0 Register Offset */
#define MATRIX_PASSR13_REG_OFST        _UINT32_(0x274)     /* (MATRIX_PASSR13) Protected Areas Split Slave 0 Register Offset */
#define MATRIX_PASSR14_REG_OFST        _UINT32_(0x278)     /* (MATRIX_PASSR14) Protected Areas Split Slave 0 Register Offset */
#define MATRIX_PASSR15_REG_OFST        _UINT32_(0x27C)     /* (MATRIX_PASSR15) Protected Areas Split Slave 0 Register Offset */
#define MATRIX_PRTSR_REG_OFST          _UINT32_(0x280)     /* (MATRIX_PRTSR) Protected Region Top Slave 0 Register Offset */
#define MATRIX_PRTSR0_REG_OFST         _UINT32_(0x280)     /* (MATRIX_PRTSR0) Protected Region Top Slave 0 Register Offset */
#define MATRIX_PRTSR1_REG_OFST         _UINT32_(0x284)     /* (MATRIX_PRTSR1) Protected Region Top Slave 0 Register Offset */
#define MATRIX_PRTSR2_REG_OFST         _UINT32_(0x288)     /* (MATRIX_PRTSR2) Protected Region Top Slave 0 Register Offset */
#define MATRIX_PRTSR3_REG_OFST         _UINT32_(0x28C)     /* (MATRIX_PRTSR3) Protected Region Top Slave 0 Register Offset */
#define MATRIX_PRTSR4_REG_OFST         _UINT32_(0x290)     /* (MATRIX_PRTSR4) Protected Region Top Slave 0 Register Offset */
#define MATRIX_PRTSR5_REG_OFST         _UINT32_(0x294)     /* (MATRIX_PRTSR5) Protected Region Top Slave 0 Register Offset */
#define MATRIX_PRTSR6_REG_OFST         _UINT32_(0x298)     /* (MATRIX_PRTSR6) Protected Region Top Slave 0 Register Offset */
#define MATRIX_PRTSR7_REG_OFST         _UINT32_(0x29C)     /* (MATRIX_PRTSR7) Protected Region Top Slave 0 Register Offset */
#define MATRIX_PRTSR8_REG_OFST         _UINT32_(0x2A0)     /* (MATRIX_PRTSR8) Protected Region Top Slave 0 Register Offset */
#define MATRIX_PRTSR9_REG_OFST         _UINT32_(0x2A4)     /* (MATRIX_PRTSR9) Protected Region Top Slave 0 Register Offset */
#define MATRIX_PRTSR10_REG_OFST        _UINT32_(0x2A8)     /* (MATRIX_PRTSR10) Protected Region Top Slave 0 Register Offset */
#define MATRIX_PRTSR11_REG_OFST        _UINT32_(0x2AC)     /* (MATRIX_PRTSR11) Protected Region Top Slave 0 Register Offset */
#define MATRIX_PRTSR12_REG_OFST        _UINT32_(0x2B0)     /* (MATRIX_PRTSR12) Protected Region Top Slave 0 Register Offset */
#define MATRIX_PRTSR13_REG_OFST        _UINT32_(0x2B4)     /* (MATRIX_PRTSR13) Protected Region Top Slave 0 Register Offset */
#define MATRIX_PRTSR14_REG_OFST        _UINT32_(0x2B8)     /* (MATRIX_PRTSR14) Protected Region Top Slave 0 Register Offset */
#define MATRIX_PRTSR15_REG_OFST        _UINT32_(0x2BC)     /* (MATRIX_PRTSR15) Protected Region Top Slave 0 Register Offset */
#define MATRIX_PPSELR_REG_OFST         _UINT32_(0x2C0)     /* (MATRIX_PPSELR) Protected Peripheral Select 1 Register Offset */
#define MATRIX_PPSELR0_REG_OFST        _UINT32_(0x2C0)     /* (MATRIX_PPSELR0) Protected Peripheral Select 1 Register Offset */
#define MATRIX_PPSELR1_REG_OFST        _UINT32_(0x2C4)     /* (MATRIX_PPSELR1) Protected Peripheral Select 1 Register Offset */
#define MATRIX_PPSELR2_REG_OFST        _UINT32_(0x2C8)     /* (MATRIX_PPSELR2) Protected Peripheral Select 1 Register Offset */

